kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbhs.c
/*
 * NXP MCX N USBHS1 sub-blocks — register models.
 *
 * Register-accurate; no actual USB transfers.  Three SysBusDevices map the
 * three windows of the high-speed USB1 instance:
 *
 *   mcxn-usbhs-phydcd (0x800)  USBHS1 PHY/DCD region (CMSIS USBHSDCD_Type).
 *                              Modelled as a permissive readback array over the
 *                              whole window; CONTROL.SR/START self-clear like
 *                              the standalone USBDCD so firmware sequencing
 *                              completes.
 *   mcxn-usbhs-core   (0x200)  EHCI-style controller (CMSIS USBHS_Type).
 *                              USBCMD.RST (bit 1) self-clears; USBSTS.HCH
 *                              (bit 12, HCHalted) tracks USBCMD.RS (run/stop)
 *                              so a halted controller reads halted; USBSTS is
 *                              W1C for the interrupt-status bits; the ID and
 *                              EHCI capability registers are read-only.
 *   mcxn-usbhs-nc     (0xE00)  Non-core control (CMSIS USBNC_Type).  Permissive
 *                              readback array over the whole window.
 *
 * Offsets/bits from the MCXN947 CMSIS header.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/timer.h"
#include "qapi/error.h"
#include "exec/cpu-common.h"
#include "hw/misc/mcxn_usbhs.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"

#include <usbredirproto.h>

/* ---- USBHS1 PHY/DCD (USBHSDCD_Type, identical layout to USBDCD_Type) ---- */

#define DCD_CONTROL        0x00
#define DCD_STATUS         0x08    /* RO */

#define DCD_CONTROL_IACK   (1u << 0)
#define DCD_CONTROL_START  (1u << 24)
#define DCD_CONTROL_SR     (1u << 25)

static uint64_t usbhs_phydcd_read(void *opaque, hwaddr off, unsigned size)
{
    MCXNUSBHSPhyDcdState *s = MCXN_USBHS_PHYDCD(opaque);

    if (off >= MCXN_USBHS_PHYDCD_SIZE) {
        return 0;
    }
    if (off == DCD_CONTROL) {
        return s->regs[DCD_CONTROL / 4] &
               ~(DCD_CONTROL_IACK | DCD_CONTROL_START | DCD_CONTROL_SR);
    }
    return s->regs[off >> 2];
}

static void usbhs_phydcd_write(void *opaque, hwaddr off, uint64_t value,
                               unsigned size)
{
    MCXNUSBHSPhyDcdState *s = MCXN_USBHS_PHYDCD(opaque);
    uint32_t v = value;

    if (off >= MCXN_USBHS_PHYDCD_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB write @0x%" HWADDR_PRIx "\n",
                      __func__, off);
        return;
    }
    if (off == DCD_STATUS) {
        return;                         /* read-only */
    }
    if (off == DCD_CONTROL) {
        s->regs[DCD_CONTROL / 4] =
            v & ~(DCD_CONTROL_IACK | DCD_CONTROL_START | DCD_CONTROL_SR);
        return;
    }
    s->regs[off >> 2] = v;
}

static const MemoryRegionOps usbhs_phydcd_ops = {
    .read = usbhs_phydcd_read,
    .write = usbhs_phydcd_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

static void usbhs_phydcd_reset(DeviceState *dev)
{
    MCXNUSBHSPhyDcdState *s = MCXN_USBHS_PHYDCD(dev);

    memset(s->regs, 0, sizeof(s->regs));
}

static void usbhs_phydcd_realize(DeviceState *dev, Error **errp)
{
    MCXNUSBHSPhyDcdState *s = MCXN_USBHS_PHYDCD(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &usbhs_phydcd_ops, s,
                          TYPE_MCXN_USBHS_PHYDCD, MCXN_USBHS_PHYDCD_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
}

static const VMStateDescription vmstate_usbhs_phydcd = {
    .name = TYPE_MCXN_USBHS_PHYDCD,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, MCXNUSBHSPhyDcdState,
                             MCXN_USBHS_PHYDCD_SIZE / 4),
        VMSTATE_END_OF_LIST()
    },
};

static void usbhs_phydcd_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = usbhs_phydcd_realize;
    device_class_set_legacy_reset(dc, usbhs_phydcd_reset);
    dc->vmsd = &vmstate_usbhs_phydcd;
}

/*
 * ---- USBHS1 core: ChipIdea/EHCI controller (USBHS_Type), device mode ----
 *
 * Device-mode endpoint engine: guest firmware programs device Queue Heads (dQH,
 * 64 B each at ENDPTLISTADDR, indexed ep*2 + (IN?1:0)) and device Transfer
 * Descriptors (dTD, 32 B); a remote USB host drives transactions via the shared
 * usbredir core.  A host SETUP is written into the EP0-OUT dQH setup buffer
 * (ENDPTSETUPSTAT + USBSTS.UI); IN/OUT data walks the primed dTD chain and
 * retires it (ENDPTCOMPLETE + USBSTS.UI).  Firmware signals primed dTDs via
 * ENDPTPRIME, which (plus a backstop tick) drives servicing.
 */

#define HS_ID           0x000   /* RO */
#define HS_HWGENERAL    0x004   /* RO */
#define HS_HWHOST       0x008   /* RO */
#define HS_HWDEVICE     0x00C   /* RO */
#define HS_HWTXBUF      0x010   /* RO */
#define HS_HWRXBUF      0x014   /* RO */
#define HS_CAPLENGTH    0x100   /* RO (CAPLENGTH + HCIVERSION packed) */
#define HS_HCSPARAMS    0x104   /* RO */
#define HS_HCCPARAMS    0x108   /* RO */
#define HS_DCIVERSION   0x120   /* RO */
#define HS_DCCPARAMS    0x124   /* RO */
#define HS_USBCMD       0x140
#define HS_USBSTS       0x144   /* W1C status bits */
#define HS_USBINTR      0x148
#define HS_DEVICEADDR   0x154
#define HS_ENDPTLISTADDR 0x158
#define HS_USBMODE      0x1A8
#define HS_ENDPTSETUPSTAT 0x1AC
#define HS_ENDPTPRIME   0x1B0   /* WO-ish, self-clears */
#define HS_ENDPTFLUSH   0x1B4
#define HS_ENDPTSTAT    0x1B8   /* RO */
#define HS_ENDPTCOMPLETE 0x1BC  /* W1C */
#define HS_ENDPTCTRL0   0x1C0   /* ENDPTCTRL[0..7] @ 0x1C0, step 4 */

/*
 * ENDPTCTRL0 reset = 0x0080_0080: RXE (bit 7) and TXE (bit 23) are SET.
 *
 * ⭐ ENDPOINT 0 IS THE CONTROL ENDPOINT AND IT IS ALWAYS ENABLED ON
 * SILICON -- that is what those bits mean, and it is why they are set out
 * of reset.  We reset the register to ZERO, so a driver asking "is the
 * control endpoint enabled?" was told NO, BY THE ONE ENDPOINT THAT CANNOT
 * BE DISABLED.
 */
#define HS_ENDPTCTRL0_RESET  0x00800080u

