kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbhs.c
#define USBCMD_RS       (1u << 0)   /* Run/Stop */
#define USBCMD_RST      (1u << 1)   /* Controller reset, self-clearing */
#define USBSTS_UI       (1u << 0)   /* USB interrupt (xfer done / setup) */
#define USBSTS_URI      (1u << 6)   /* USB reset received */
#define USBSTS_HCH      (1u << 12)  /* HCHalted */
#define USBMODE_CM_MASK 0x3
#define USBMODE_CM_DEVICE 0x2       /* CM = 0b10 = device controller */

/* dTD / dQH token bits. */
#define DTD_ACTIVE      (1u << 7)
#define DTD_IOC         (1u << 15)
#define DTD_TOTBYTES_SHIFT 16
#define DTD_TOTBYTES_MASK  0x7FFF
#define DTD_TERMINATE   (1u << 0)
#define DQH_SETUP0      0x28        /* setup buffer in the dQH               */

#define SOF_PERIOD_NS   (1 * 1000 * 1000)   /* 1 ms backstop */

/*
 * EHCI capability constants for this controller.  CAPLENGTH = 0x40 (operational
 * registers begin 0x40 past CAPLENGTH, i.e. at 0x140) with HCIVERSION 0x0100 in
 * the upper half-word.
 *
 * ⚠ THESE WERE FABRICATED, AND THE COMMENT ABOVE THEM SAID SO IN A WORD I
 * DID NOT HEAR MYSELF USE: "mark as APPROXIMATE where the RM reset was not
 * machine-readable".
 *
 *     ⭐ "APPROXIMATE", "NOMINAL", "PLAUSIBLE", "REASONABLE", "BEST-EFFORT"
 *        ARE THE WORDS YOU USE WHEN YOU MEAN FABRICATED.  Grepping the tree
 *        for that vocabulary is what found these -- the register file was
 *        lying about WHAT THE PART IS, and it had annotated its own lie.
 *
 * And they were not even self-consistent: DCCPARAMS said "8 EP" while
 * HWDEVICE reported DEVEP = 2.  TWO REGISTERS DESCRIBING THE SAME SILICON,
 * DISAGREEING WITH EACH OTHER -- which is what invention looks like from
 * the inside.
 *
 * The real values, from the RM's reset column (read back and diffed by
 * tests/mcxn-reset-values, whose golden IS the reference manual):
 *
 *   ID       0xE4A1FA05   (we said 0x0022FA05 -- not even the right part)
 *   HWDEVICE 0x00000011   DC=1, DEVEP=8.  WE SAID 0x05: DEVEP = 2.  A
 *                         driver that sizes its endpoint arrays from this
 *                         saw A QUARTER of the endpoints the silicon has.
 *   HWTXBUF  0x80050808   TX burst/buffer geometry (we said 0x80040020)
 *   HWRXBUF  0x00000808   RX burst/buffer geometry (we said 0x00000020)
 *   HWGENERAL 0x00000015  (we returned 0)
 */
#define HS_ID_VALUE          0xE4A1FA05u   /* RM reset */
#define HS_HWGENERAL_VALUE   0x00000015u   /* RM reset */
#define HS_HWHOST_VALUE      0x10020001u   /* RM reset (this one WAS right) */
#define HS_HWDEVICE_VALUE    0x00000011u   /* RM reset: DC=1, DEVEP=8 */
#define HS_HWTXBUF_VALUE     0x80050808u   /* RM reset */
#define HS_HWRXBUF_VALUE     0x00000808u   /* RM reset */
/* HCIVERSION:0x0100, CAPLENGTH:0x40 */
#define HS_CAPLENGTH_VALUE   0x01000040u
#define HS_HCSPARAMS_VALUE   0x00010011u   /* RM reset (this one WAS right) */
/* async sched park + prog frame list */
#define HS_HCCPARAMS_VALUE   0x00000006u
#define HS_DCIVERSION_VALUE  0x00000001u
/* device capable, host capable, 8 EP */
#define HS_DCCPARAMS_VALUE   0x00000188u

/* USBSTS interrupt-status bits are W1C; HCH is status-only (not W1C). */
#define USBSTS_W1C_MASK      0x000003FFu

/* ---- dQH/dTD memory access ---------------------------------------------- */

static uint32_t hs_ld(uint32_t addr)
{
    uint32_t w = 0;
    cpu_physical_memory_read(addr, &w, 4);
    return le32_to_cpu(w);
}

static void hs_st(uint32_t addr, uint32_t w)
{
    uint32_t t = cpu_to_le32(w);
    cpu_physical_memory_write(addr, &t, 4);
}

/* dQH base for (ep, dir): list base (2 KiB aligned) + index*64. */
static uint32_t hs_dqh(MCXNUSBHSCoreState *s, int ep, bool in)
{
    return (s->regs[HS_ENDPTLISTADDR / 4] & ~0x7FFu) +
           (ep * 2 + (in ? 1 : 0)) * 64;
}

static void usbhs_core_update_irq(MCXNUSBHSCoreState *s)
{
    bool active = (s->regs[HS_USBSTS / 4] & s->regs[HS_USBINTR / 4] &
                   USBSTS_W1C_MASK) != 0;

    qemu_set_irq(s->irq, active);
}

static void usbhs_ui(MCXNUSBHSCoreState *s)
{
    s->regs[HS_USBSTS / 4] |= USBSTS_UI;
    usbhs_core_update_irq(s);
}

/* Fetch the active dTD for (ep,dir): returns its address or 0 if none ready. */
static uint32_t hs_active_dtd(MCXNUSBHSCoreState *s, int ep, bool in)
{
    uint32_t qh = hs_dqh(s, ep, in);
    uint32_t next = hs_ld(qh + 8);
    uint32_t dtd, token;

    if (next & DTD_TERMINATE) {
        return 0;
    }
    dtd = next & ~0x1Fu;
    token = hs_ld(dtd + 4);
    return (token & DTD_ACTIVE) ? dtd : 0;
}

/* Retire a dTD: clear ACTIVE, set the remaining byte count, advance the dQH. */
static void hs_retire_dtd(MCXNUSBHSCoreState *s, int ep, bool in,
                          uint32_t dtd, int remaining)
{
    uint32_t qh = hs_dqh(s, ep, in);
    uint32_t token = hs_ld(dtd + 4);

    token &= ~0xFFu;                               /* clear status (ACTIVE) */
    token = (token & ~(DTD_TOTBYTES_MASK << DTD_TOTBYTES_SHIFT)) |
            ((remaining & DTD_TOTBYTES_MASK) << DTD_TOTBYTES_SHIFT);
    hs_st(dtd + 4, token);
    hs_st(qh + 4, dtd);                            /* currentDtdPointer */
    hs_st(qh + 8, hs_ld(dtd));                  /* nextDtdPointer = dtd.next */
}

/* IN data stage: copy the primed dTD's bytes to the host. */
static bool usbhs_service_in(MCXNUSBHSCoreState *s, int ep)
{
    MCXNUSBHSXfer *x = &s->ep[ep];
    uint32_t dtd = hs_active_dtd(s, ep, true);
    uint8_t buf[MCXN_USBHS_XFERMAX];
    uint32_t token, bufp;
    int total, n;

    if (!dtd) {
        return false;
    }
    token = hs_ld(dtd + 4);
    total = (token >> DTD_TOTBYTES_SHIFT) & DTD_TOTBYTES_MASK;
    bufp = hs_ld(dtd + 8);
    n = total;
    if (n > x->in_len) {
        n = x->in_len;
    }
    if (n > MCXN_USBHS_XFERMAX) {
        n = MCXN_USBHS_XFERMAX;
    }
    cpu_physical_memory_read(bufp, buf, n);
    hs_retire_dtd(s, ep, true, dtd, total - n);
    s->regs[HS_ENDPTCOMPLETE / 4] |= (1u << (16 + ep));   /* TX complete */
    usbhs_ui(s);
    x->in_pending = false;
    mcxn_usbdev_complete_in(s->usbdev, ep, buf, n);
    return true;
}

