kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbhs.c
/* OUT data stage: write host bytes into the primed dTD's buffer. */
static bool usbhs_service_out(MCXNUSBHSCoreState *s, int ep)
{
    MCXNUSBHSXfer *x = &s->ep[ep];
    uint32_t dtd = hs_active_dtd(s, ep, false);
    uint32_t token, bufp;
    int cap, n;

    if (!dtd) {
        return false;
    }
    token = hs_ld(dtd + 4);
    cap = (token >> DTD_TOTBYTES_SHIFT) & DTD_TOTBYTES_MASK;
    bufp = hs_ld(dtd + 8);
    n = x->out_len;
    if (n > cap) {
        n = cap;
    }
    if (n) {
        cpu_physical_memory_write(bufp, x->out_buf, n);
    }
    hs_retire_dtd(s, ep, false, dtd, cap - n);
    s->regs[HS_ENDPTCOMPLETE / 4] |= (1u << ep);          /* RX complete */
    usbhs_ui(s);
    x->out_pending = false;
    mcxn_usbdev_complete_out(s->usbdev, ep, MCXN_USB_XFER_OK, n);
    return true;
}

/* Drain the zero-length status-IN dTD of a host->device control transfer. */
static bool usbhs_consume_status_in(MCXNUSBHSCoreState *s)
{
    uint32_t dtd = hs_active_dtd(s, 0, true);

    if (!dtd) {
        return false;
    }
    hs_retire_dtd(s, 0, true, dtd, 0);
    s->regs[HS_ENDPTCOMPLETE / 4] |= (1u << 16);          /* EP0 TX complete */
    usbhs_ui(s);
    s->ep0_status_in = false;
    mcxn_usbdev_complete_out(s->usbdev, 0, MCXN_USB_XFER_OK, 0);
    return true;
}

/* Make progress on whatever the firmware has primed. */
static void usbhs_service(MCXNUSBHSCoreState *s)
{
    int ep;

    if (!s->enabled) {
        return;
    }
    if (s->ep0_status_in) {
        usbhs_consume_status_in(s);
    }
    for (ep = 0; ep < MCXN_USBHS_NEP; ep++) {
        if (s->ep[ep].out_pending) {
            usbhs_service_out(s, ep);
        }
        if (s->ep[ep].in_pending && !(ep == 0 && s->ep0_status_in)) {
            usbhs_service_in(s, ep);
        }
    }
}

static void usbhs_sof(void *opaque)
{
    MCXNUSBHSCoreState *s = opaque;

    if (!s->enabled) {
        return;
    }
    usbhs_service(s);
    /*
     * Re-arm from the previous DEADLINE, never from "now": re-adding the
     * callback's dispatch latency every frame makes the error accumulate, and
     * the USB frame rate is a timing contract, not a suggestion.
     */
    s->next_sof_ns += SOF_PERIOD_NS;
    timer_mod(s->sof, s->next_sof_ns);
}

/* ---- usbredir backend ops ----------------------------------------------- */

static void usbhs_be_setup(void *be, const uint8_t setup[8])
{
    MCXNUSBHSCoreState *s = be;
    uint32_t qh0 = hs_dqh(s, 0, false);    /* EP0 OUT dQH holds the setup buf */

    hs_st(qh0 + DQH_SETUP0,     setup[0] | (setup[1] << 8) |
                                (setup[2] << 16) | (setup[3] << 24));
    hs_st(qh0 + DQH_SETUP0 + 4, setup[4] | (setup[5] << 8) |
                                (setup[6] << 16) | (setup[7] << 24));
    s->regs[HS_ENDPTSETUPSTAT / 4] |= 1;    /* EP0 setup pending */
    s->ep0_status_in = !(setup[0] & 0x80);  /* host->device -> status is IN */
    s->ep[0].in_pending = false;
    s->ep[0].out_pending = false;
    usbhs_ui(s);
}

static int usbhs_be_ep_in(void *be, int ep, uint8_t *buf, int len, int *out_len)
{
    MCXNUSBHSCoreState *s = be;

    s->ep[ep & 7].in_pending = true;
    s->ep[ep & 7].in_len = len;
    *out_len = 0;
    usbhs_service(s);
    return MCXN_USB_XFER_ASYNC;
}

static int usbhs_be_ep_out(void *be, int ep, const uint8_t *buf, int len)
{
    MCXNUSBHSCoreState *s = be;
    MCXNUSBHSXfer *x = &s->ep[ep & 7];

    if (len > MCXN_USBHS_XFERMAX) {
        len = MCXN_USBHS_XFERMAX;
    }
    if (len) {
        memcpy(x->out_buf, buf, len);
    }
    x->out_len = len;
    x->out_pending = true;
    usbhs_service(s);
    return MCXN_USB_XFER_ASYNC;
}

/* firmware writes DEVICEADDR */
static void usbhs_be_set_address(void *be, uint8_t addr) { }
/* firmware handles */
static void usbhs_be_set_config(void *be, uint8_t cfg) { }

/*
 * Host USB bus reset: drop transient transfer state and post USBSTS.URI + IRQ
 * so guest firmware re-inits its endpoints for a fresh enumeration (a reused
 * usbredir server can then re-enumerate a new client).
 */
static void usbhs_be_bus_reset(void *be)
{
    MCXNUSBHSCoreState *s = be;
    int ep;

    for (ep = 0; ep < MCXN_USBHS_NEP; ep++) {
        s->ep[ep].in_pending = false;
        s->ep[ep].out_pending = false;
    }
    s->ep0_status_in = false;
    s->regs[HS_USBSTS / 4] |= USBSTS_URI;   /* USB reset received */
    usbhs_core_update_irq(s);               /* fires if firmware enabled URE */
}

static const MCXNUsbBackendOps usbhs_be_ops = {
    .setup       = usbhs_be_setup,
    .ep_in       = usbhs_be_ep_in,
    .ep_out      = usbhs_be_ep_out,
    .set_address = usbhs_be_set_address,
    .set_config  = usbhs_be_set_config,
    .bus_reset   = usbhs_be_bus_reset,
};

/* ---- MMIO --------------------------------------------------------------- */

/* PORTSC1[PSPD]: 00 Full, 01 Low, 10 High, 11 Undefined. */
#define PORTSC1_PSPD_SHIFT   26
#define PORTSC1_PSPD_MASK    (3u << PORTSC1_PSPD_SHIFT)
#define PORTSC1_PSPD_HIGH    (2u << PORTSC1_PSPD_SHIFT)
#define USBCMD_RS            (1u << 0)   /* Run/Stop */

static uint64_t usbhs_core_read(void *opaque, hwaddr off, unsigned size)
{
    MCXNUSBHSCoreState *s = MCXN_USBHS_CORE(opaque);
    uint32_t v;

    if (off >= MCXN_USBHS_CORE_SIZE) {
        return 0;
    }

    switch (off) {
    case 0x184: {
        /*
         * ⭐ PSPD IS A STATUS FIELD, SO IT MUST FOLLOW THE PORT -- NOT SIT
         *   AT A CONSTANT.
         *
         *   Its reset value (Undefined) is honest: at power-on nothing has
         *   enumerated and the speed genuinely is not known.  But leaving it
         *   there forever would be the mirror of the bug we just fixed -- a
         *   driver polling for a definite speed would never get one.
         *
         *   This is a HIGH-SPEED controller and the model links at high
         *   speed, so once the guest starts the controller (USBCMD[RS]) the
         *   port is operating and PSPD reports the speed we ACTUALLY run at.
         *   Before that it says UNDEFINED, which is the truth.
         *
         *   (We used to return 0 here, which on this field is not "no
         *   answer" -- it is FULL SPEED.  A driver would have sized its
         *   endpoints for 64-byte packets on a controller that does 512.)
         */
        uint32_t portsc = s->regs[0x184 / 4];

        if (s->regs[HS_USBCMD / 4] & USBCMD_RS) {
            portsc = (portsc & ~PORTSC1_PSPD_MASK) | PORTSC1_PSPD_HIGH;
        }
        return portsc;
    }
    case HS_ID:         return HS_ID_VALUE;
    case HS_HWGENERAL:  return HS_HWGENERAL_VALUE;
    case HS_HWHOST:     return HS_HWHOST_VALUE;
    case HS_HWDEVICE:   return HS_HWDEVICE_VALUE;
    case HS_HWTXBUF:    return HS_HWTXBUF_VALUE;
    case HS_HWRXBUF:    return HS_HWRXBUF_VALUE;
    case HS_CAPLENGTH:  return HS_CAPLENGTH_VALUE;
    /*
     * HCIVERSION is the UPPER HALFWORD of CAPLENGTH, and the RM lists it as
     * its own 16-BIT register at 0x102.  We answered only the 32-bit read at
     * 0x100, so a HALFWORD read of HCIVERSION -- which is exactly how EHCI
     * says to read it -- fell through to the default and RETURNED ZERO.  The
     * gate could not see that until it learned to read registers AT THEIR
     * TRUE WIDTH.
     */
    case HS_CAPLENGTH + 2: return HS_CAPLENGTH_VALUE >> 16;
    case HS_HCSPARAMS:  return HS_HCSPARAMS_VALUE;
    case HS_HCCPARAMS:  return HS_HCCPARAMS_VALUE;
    case HS_DCIVERSION: return HS_DCIVERSION_VALUE;
    case HS_DCCPARAMS:  return HS_DCCPARAMS_VALUE;
    case HS_USBCMD:
        return s->regs[HS_USBCMD / 4] & ~USBCMD_RST;  /* RST self-clears */
    case HS_USBSTS:
        /* HCHalted reflects run/stop: halted whenever RS is clear. */
        v = s->regs[HS_USBSTS / 4] & ~USBSTS_HCH;
        if (!(s->regs[HS_USBCMD / 4] & USBCMD_RS)) {
            v |= USBSTS_HCH;
        }
        return v;
    case HS_ENDPTPRIME:
        return 0;                       /* prime is momentary: reads back 0 */
    default:
        return s->regs[off >> 2];
    }
}

static void usbhs_core_write(void *opaque, hwaddr off, uint64_t value,
                             unsigned size)
{
    MCXNUSBHSCoreState *s = MCXN_USBHS_CORE(opaque);
    uint32_t v = value;

    if (off >= MCXN_USBHS_CORE_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB write @0x%" HWADDR_PRIx "\n",
                      __func__, off);
        return;
    }

    switch (off) {
    case HS_ID:
    case HS_HWGENERAL:
    case HS_HWHOST:
    case HS_HWDEVICE:
    case HS_HWTXBUF:
    case HS_HWRXBUF:
    case HS_CAPLENGTH:
    case HS_HCSPARAMS:
    case HS_HCCPARAMS:
    case HS_DCIVERSION:
    case HS_DCCPARAMS:
    case HS_ENDPTSTAT:
        return;                         /* read-only */
    case HS_USBCMD:
        if (v & USBCMD_RST) {           /* reset: operational regs to default */
            s->regs[HS_USBCMD / 4] = 0;
            s->regs[HS_USBSTS / 4] = 0;
            s->regs[HS_USBINTR / 4] = 0;
            s->enabled = false;
            timer_del(s->sof);
            usbhs_core_update_irq(s);
            return;
        }
        s->regs[HS_USBCMD / 4] = v;
        if ((v & USBCMD_RS) &&
            (s->regs[HS_USBMODE / 4] & USBMODE_CM_MASK) == USBMODE_CM_DEVICE &&
            !s->enabled) {
            /*
             * Run + device mode: a device appears on the bus.  High-speed:
             * the ChipIdea is HS silicon and a real EHCI host (ci_hdrc) is
             * HS-only (no companion/TT), so it rejects a full-speed device
             * at attach.  The gadget is a coherent HS device — 512-byte bulk
             * + a valid device_qualifier (see tests/mcxn-usb-hs) — so HS
             * attaches cleanly and the kernel finalizes enumeration.
             */
            s->enabled = true;
            s->next_sof_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
                             SOF_PERIOD_NS;
            timer_mod(s->sof, s->next_sof_ns);
            mcxn_usbdev_attach(s->usbdev, usb_redir_speed_high);
        } else if (!(v & USBCMD_RS) && s->enabled) {
            s->enabled = false;
            timer_del(s->sof);
            mcxn_usbdev_detach(s->usbdev);
        }
        return;
    case HS_USBSTS:
        s->regs[HS_USBSTS / 4] &= ~(v & USBSTS_W1C_MASK);   /* W1C */
        usbhs_core_update_irq(s);
        return;
    case HS_USBINTR:
        s->regs[HS_USBINTR / 4] = v;
        usbhs_core_update_irq(s);
        return;
    case HS_ENDPTSETUPSTAT:
        s->regs[off >> 2] &= ~v;        /* W1C */
        return;
    case HS_ENDPTCOMPLETE:
        s->regs[off >> 2] &= ~v;        /* W1C */
        return;
    case HS_ENDPTPRIME:
        /* Firmware primed dTD(s): note ready endpoints, then service. */
        s->regs[HS_ENDPTSTAT / 4] |= v;
        usbhs_service(s);
        return;
    case HS_ENDPTFLUSH:
        s->regs[HS_ENDPTSTAT / 4] &= ~v;
        return;
    default:
        s->regs[off >> 2] = v;
        return;
    }
}

