kylefoxaustin/mcxn947qemu/hw/misc/mcxn_usbhs.c
static const MemoryRegionOps usbhs_core_ops = {
    .read = usbhs_core_read,
    .write = usbhs_core_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

/*
 * ⚠ THE CORE CAME UP AS memset(0), AND ZERO IS A LEGAL, MEANINGFUL, WRONG
 *   VALUE ON HALF OF THESE.  RM reset values, derived -- never invented.
 *
 * ☠ PORTSC1 IS THE ONE THAT MATTERS.  RM reset = 0x1C00_0004:
 *
 *      PE   (bit 2)      = 1   "In Device mode: the device port is always
 *      enabled"
 *      PSPD (bits 27:26) = 3   UNDEFINED
 *      (00=Full  01=Low  10=High  11=Undefined)
 *      PTW  (bit 28)     = 1   16-bit UTMI
 *
 *   We returned ZERO.  On PSPD, zero does not mean "no answer" -- IT MEANS
 *   FULL SPEED.
 *
 *     ⭐ A DRIVER ASKING A HIGH-SPEED CONTROLLER "WHAT SPEED DID I ENUMERATE
 *       AT?" GOT BACK A CONFIDENT "FULL SPEED", AND WOULD HAVE SIZED ITS
 *       ENDPOINTS FOR 64-BYTE PACKETS INSTEAD OF 512.
 *
 *   ⭐ AND THE RM'S RESET VALUE IS *MORE HONEST THAN OUR ZERO*: it says
 *     UNDEFINED -- "the speed is not known yet" -- where we said "Full
 *     Speed", which is an answer.  A ZERO IS NOT THE ABSENCE OF A CLAIM.  ON
 *     AN ENCODED FIELD IT IS WHICHEVER CLAIM HAPPENS TO BE ENCODED AS ZERO.
 *
 *   PSPD is a STATUS field, so it does not stay at its reset value: it
 *   FOLLOWS the port.  See the read handler -- undefined until the
 *   controller runs, then the speed we actually operate at.  (A config
 *   register's reset value is a FACT; a status register's is a DESCRIPTION
 *   OF A STATE, and copying it into a model that is not in that state is a
 *   fabrication.)
 *
 * The rest are CONFIG registers the vendor driver READ-MODIFY-WRITES, so
 * our zeros were being laundered into the guest's own state (93emulator's
 * class):
 *
 *      USBCMD  ITC = 8      -- interrupt threshold; our 0 = "interrupt
 *      immediately"
 *      BURSTSIZE   = 0x0808 -- TX/RX burst of 8; our 0 = a zero-length burst
 *      SBUSCFG     = 2      -- AHB burst config
 *      CONFIGFLAG  CF = 1   -- port routed to this controller
 *      USBMODE     = 0x5000
 */
static const struct { uint16_t off; uint32_t val; } usbhs_core_reset_vals[] = {
    { 0x090, 0x00000002u },   /* SBUSCFG */
    { 0x140, 0x00080000u },   /* USBCMD      ITC = 8 */
    { 0x160, 0x00000808u },   /* BURSTSIZE   TX/RX burst = 8 */
    { 0x180, 0x00000001u },   /* CONFIGFLAG  CF = 1 */
    { 0x184, 0x1C000004u },   /* PORTSC1     PE=1, PSPD=Undefined, PTW=16-bit */
    { 0x1A8, 0x00005000u },   /* USBMODE */
};

static void usbhs_core_reset(DeviceState *dev)
{
    MCXNUSBHSCoreState *s = MCXN_USBHS_CORE(dev);

    int rv;

    memset(s->regs, 0, sizeof(s->regs));
    for (rv = 0; rv < (int)ARRAY_SIZE(usbhs_core_reset_vals); rv++) {
        s->regs[usbhs_core_reset_vals[rv].off / 4] =
            usbhs_core_reset_vals[rv].val;
    }
    s->regs[HS_ENDPTCTRL0 / 4] = HS_ENDPTCTRL0_RESET;
    memset(s->ep, 0, sizeof(s->ep));
    s->enabled = false;
    s->ep0_status_in = false;
    timer_del(s->sof);
}

static void usbhs_core_realize(DeviceState *dev, Error **errp)
{
    MCXNUSBHSCoreState *s = MCXN_USBHS_CORE(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &usbhs_core_ops, s,
                          TYPE_MCXN_USBHS_CORE, MCXN_USBHS_CORE_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);

    s->sof = timer_new_ns(QEMU_CLOCK_VIRTUAL, usbhs_sof, s);
    if (s->usbdev) {
        mcxn_usbdev_set_backend(s->usbdev, &usbhs_be_ops, s);
    }
}

/* Re-drive the IRQ line from restored register state after migration: the
 * output line is not part of vmstate, so a VM migrated with an enabled+pending
 * USBSTS/USBINTR would otherwise land with the line low and the guest's level
 * IRQ lost.  (Only the core has an interrupt; the phydcd/nc windows have no
 * output line.) */
static int usbhs_core_post_load(void *opaque, int version_id)
{
    usbhs_core_update_irq(MCXN_USBHS_CORE(opaque));
    return 0;
}

static const VMStateDescription vmstate_usbhs_core = {
    .name = TYPE_MCXN_USBHS_CORE,
    .version_id = 2,
    .minimum_version_id = 2,
    .post_load = usbhs_core_post_load,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, MCXNUSBHSCoreState,
                             MCXN_USBHS_CORE_SIZE / 4),
        VMSTATE_END_OF_LIST()
    },
};

static const Property usbhs_core_props[] = {
    DEFINE_PROP_LINK("usbdev", MCXNUSBHSCoreState, usbdev, TYPE_MCXN_USBDEV,
                     MCXNUsbDevState *),
};

static void usbhs_core_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = usbhs_core_realize;
    device_class_set_legacy_reset(dc, usbhs_core_reset);
    device_class_set_props(dc, usbhs_core_props);
    dc->vmsd = &vmstate_usbhs_core;
}

/* ---- USBHS1 non-core control (USBNC_Type) ---- */

static uint64_t usbhs_nc_read(void *opaque, hwaddr off, unsigned size)
{
    MCXNUSBHSNcState *s = MCXN_USBHS_NC(opaque);

    return (off < MCXN_USBHS_NC_SIZE) ? s->regs[off >> 2] : 0;
}

static void usbhs_nc_write(void *opaque, hwaddr off, uint64_t value,
                           unsigned size)
{
    MCXNUSBHSNcState *s = MCXN_USBHS_NC(opaque);

    if (off >= MCXN_USBHS_NC_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB write @0x%" HWADDR_PRIx "\n",
                      __func__, off);
        return;
    }
    s->regs[off >> 2] = value;
}

static const MemoryRegionOps usbhs_nc_ops = {
    .read = usbhs_nc_read,
    .write = usbhs_nc_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

static void usbhs_nc_reset(DeviceState *dev)
{
    MCXNUSBHSNcState *s = MCXN_USBHS_NC(dev);

    /*
     * USBNC (the non-core wrapper) RM reset values.  Derived from the
     * manual, never invented.  These are mostly reserved/undocumented bits
     * -- but a zero is still a CLAIM, and the vendor driver read-modify-writes
     * CTRL1 (wakeup enables), so our zeros were being laundered into the
     * guest's own state.  Nothing in this model READS them, which is
     * precisely what made them safe to get wrong for so long:
     *
     *   ⭐ A DEAD REGISTER HAS NO BUGS -- UNTIL YOU FIX SOMETHING DOWNSTREAM
     *      OF IT.
     *     (91emulator, who watched exactly this detonate two blocks over.)
     */
    memset(s->regs, 0, sizeof(s->regs));
    s->regs[0x000 / 4] = 0x30001000u;   /* CTRL1     */
    s->regs[0x010 / 4] = 0x10004084u;   /* HSIC_CTRL */
}

static void usbhs_nc_realize(DeviceState *dev, Error **errp)
{
    MCXNUSBHSNcState *s = MCXN_USBHS_NC(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &usbhs_nc_ops, s,
                          TYPE_MCXN_USBHS_NC, MCXN_USBHS_NC_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
}

static const VMStateDescription vmstate_usbhs_nc = {
    .name = TYPE_MCXN_USBHS_NC,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, MCXNUSBHSNcState, MCXN_USBHS_NC_SIZE / 4),
        VMSTATE_END_OF_LIST()
    },
};

static void usbhs_nc_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = usbhs_nc_realize;
    device_class_set_legacy_reset(dc, usbhs_nc_reset);
    dc->vmsd = &vmstate_usbhs_nc;
}

/* ---- Type registration ---- */

static const TypeInfo mcxn_usbhs_types[] = {
    {
        .name          = TYPE_MCXN_USBHS_PHYDCD,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNUSBHSPhyDcdState),
        .class_init    = usbhs_phydcd_class_init,
    },
    {
        .name          = TYPE_MCXN_USBHS_CORE,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNUSBHSCoreState),
        .class_init    = usbhs_core_class_init,
    },
    {
        .name          = TYPE_MCXN_USBHS_NC,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNUSBHSNcState),
        .class_init    = usbhs_nc_class_init,
    },
};

DEFINE_TYPES(mcxn_usbhs_types)
